//==========================================================
//
//ライト処理 [light.h]
//Author Ibuki Okusada
//
//==========================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

#include "main.h"		//main.hで定義しているものが必要なためinclude

//==========================================================
//マクロ定義
//==========================================================
#define NUM_LIGHT	(3)		//ライトの数

//==========================================================
//プロトタイプ宣言
//==========================================================
void InitLight(void);
void UninitLight(void);
void UpdateLight(void);
D3DLIGHT9 *GetLight(void);
int GetSelectLight(void);

#endif