//
//
//ランキング処理 [ranking.cpp]
//Author Ibuki Okusada
//
//=======================================
#include "ranking.h"   //作成したRsesult.hをインクルードする
#include "input.h"
#include "fade.h"
#include "sound.h"
#include "fileload.h"
#include "texture.h"
#include "meshfield.h"
#include "meshwall.h"
#include "camera.h"
#include "light.h"
#include "model.h"

//=======================================
//マクロ定義
//=======================================

//=======================================
//列挙型の定義
//=======================================

//=======================================
//構造体の定義
//=======================================

//=======================================
//プロトタイプ宣言
//=======================================

//=======================================
//グローバル変数
//=======================================

//=======================================
//テクスチャファイル名
//=======================================

//========================================
//ランキングの初期化処理
//========================================
void InitRanking(void)
{
	PlaySound(SOUND_LABEL_BGMRANKING);
}

//========================================
//ランキングの終了処理
//========================================
void UninitRanking(void)
{
	StopSound();	//BGMの停止
}

//========================================
//ランキングの更新処理
//========================================
void UpdateRanking(void)
{
#ifdef _DEBUG
	if (GetKeyboardTrigger(DIK_RETURN) == true)
	{//遷移キーが押された
		SetFade(MODE_TEAMLOGO);
		PlaySound(SOUND_LABEL_SEBUTTON);
	}
#endif
}

//========================================
//ランキングの描画処理
//========================================
void DrawRanking(void)
{

}
