//==========================================================
//
//チュートリアル画面処理 [tutorial.h]
//Author Ibuki Okusada
//
//==========================================================
#ifndef _TUTORIAL_H_	//このマクロ定義が定義されていなかったら
#define _TUTORIAL_H_    //2連インクルード防止のマクロを定義する

#include "main.h"    //作成したmain.hをインクルードする

//==========================================================
//マクロ定義
//==========================================================

//==========================================================
//プロトタイプ宣言
//==========================================================
void InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);

#endif
