//==================================================================================================
//
//book.h
//Author:髙山桃也
//
//==================================================================================================

#ifndef _BOOK_H_
#define _BOOK_H_

#include "main.h"

//*****************************************************
// マクロ定義
//*****************************************************
#define NUM_BOOK	(2)	//本の数

//*****************************************************
// 列挙型定義
//*****************************************************
typedef enum
{
	BOOKSTATE_NONE = 0,	//何もしていない状態
	BOOKSTATE_IN,	//スライドイン状態
	BOOKSTATE_OPEN,	//開いている状態
	BOOKSTATE_WAIT,	//開いている状態
	BOOKSTATE_OUT,	//スライドアウト状態
	BOOKSTATE_END,	//終了状態
	BOOKSTATE_MAX
}BOOKSTATE;

//*****************************************************
// 構造体宣言
//*****************************************************
typedef struct
{
	D3DXVECTOR3 pos;								//位置
	D3DXVECTOR3 rot;								//向き
	D3DXMATRIX mtxWorld;							//ワールドマトリックス
	bool bUse;										//使用しているかどうか
}Book;

//*****************************************************
// プロトタイプ宣言
//*****************************************************
void InitBook(void);
void UninitBook(void);
void UpdateBook(void);
void DrawBook(void);
BOOKSTATE *GetBookState(void);
Book *GetBook(void);
#endif