//=============================================================================
//
// サウンド処理 [light.h]
// Author :中村陸
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

#include "main.h"

//マクロ定義---------------------------
#define NUM_LIGHT (4)

//列挙型定義---------------------------

//サウンドクラス
class CLight
{
public:

	CLight();
	~CLight();

	//メンバ関数
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

	//静的メンバ関数

private:

	//メンバ関数

	//メンバ変数
	D3DLIGHT9 m_aLight[NUM_LIGHT];		//ライトの情報

	//静的メンバ変数

};

//構造体定義---------------------------

//プロトタイプ宣言---------------------

#endif // !_LIGHT_H_
